# Вся строка после решетки не учитывается

@{
    folder = 'C:\Users\KolmogorovRV\Downloads'   #Путь к папке "Загрузки"

    columns = @{
        code = 6     #Номер столбца 'Штрих-код'
        count = 5    #Номер столбца 'Количество'
        cargo = 4    #Номер столбца 'Мест'
        warning = 7  #Номер столбца 'Это важно'
    }

    code_start = 'D8'   #Адрес верхней ячейки со штрих-кодом
    count_start = 'J8'  #Адрес верхней ячейки с количеством

    search_from_clipboard = 1

    warning_codes = @{  #Коды, для которых ставится метка 'Это важно'
        # Код = 'Комментарий'
	# 4810015012556 = 'Снежок'
    }
    remove_codes = @{  #Удаление кодов
        # Код = 'Комментарий'
	# 4810015006180 = 'Масло 72.5% 100г.'
	# 4810397008918 = 'Молоко 2.5% Сафийка'
    }
    replace_codes = @{  #Замена кодов
        # Код_в_заявке = Новый_код, 'Комментарий'
        # 4810015012815 = 4810015012808, 'Сочное лето апельсин на грейпфрут'
         48100397006822 = 4810397006822, 'Кефир 3.2% Софийка'
         48100397008840 = 4810397008840, 'Кефир 2.5% Софийка 1.43'
        # 4810397008680 = 4810397005849, 'Майонез'
        # 4810397004507 = 4810397006815, 'Кефир 2.5% Бут. Полоцк'
        # 4810397005139 = 4810397006822, 'Кефир 3.2% Бут. Полоцк'
        # 4810397004538 = 4810397006853, 'Молоко 2.5% Бут. Полоцк'
        # 4810397004545 = 4810397006860, 'Молоко 3.2% Бут. Полоцк'
        # 4810397008611 = 4810397008970, 'Творог 5% Полоцк'
    }
    recalc_codes = @{  #Пересчет количества
        # Код = Штук_в_месте, 'Комментарий'
         4810015008030 = 22, 'Творог 1% брикет'
         4810015008054 = 22, 'Творог 9% брикет' 
         4810397008970 = 22, 'Творог 5% брикет Софийка'   
	 4810397008062 = 25, 'Сметана 15% 400 г Софийка'
    }
}